Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx.svd
      </registers>
    </peripheral>

	<peripheral derivedFrom="DMA1">
      <name>DMA2</name>
      <baseAddress>0x40020400</baseAddress>
      <interrupt>
        <name>DMA2_CH1</name>
        <description>DMA2 Channel1 global interrupt</description>
        <value>102</value>
      </interrupt>
      <interrupt>
        <name>DMA2_CH2</name>
        <description>DMA2 Channel2 global interrupt</description>
        <value>103</value>
      </interrupt>
      <interrupt>
        <name>DMA2_CH3</name>
        <description>DMA2 Channel3 global interrupt</description>
        <value>104</value>
      </interrupt>
      <interrupt>
        <name>DMA2_CH4</name>
        <description>DMA2 Channel4 global interrupt</description>
        <value>105</value>
      </interrupt>
      <interrupt>
        <name>DMA2_CH5</name>
        <description>DMA2 Channel5 global interrupt</description>
        <value>106</value>
      </interrupt>
      <interrupt>
        <name>DMA2_CH6</name>
        <description>DMA2 Channel6 global interrupt</description>
        <value>107</value>
      </interrupt>
      <interrupt>
        <name>DMA2_CH7</name>
        <description>DMA2 Channel7 global interrupt</description>
        <value>108</value>
      </interrupt>
      <interrupt>
        <name>DMA2_CH8</name>
        <description>DMA2 Channel8 global interrupt</description>
        <value>109</value>
      </interrupt>
    </peripheral>

    <peripheral>
      <name>DMAMUX</name>
      <description>DMA request multiplexer</description>
      <groupName>DMAMUX</groupName>
      <baseAddress>0x40020800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DMAMUX1_4_CFGR</name>
          <displayName>DMAMUX1_4_CFGR</displayName>
          <description>DMA request multiplexer channels 1 to 4 configuration registers</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000</resetValue>
          <fields>

            <field>
              <name>CHANNEL1_MUX</name>
              <description>DMA request multiplexer channels 1 intput to the volunteer configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>			
            <field>
              <name>CHANNEL2_MUX</name>
              <description>DMA request multiplexer channels 2 intput to the volunteer configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>			
            <field>
              <name>CHANNEL3_MUX</name>
              <description>DMA request multiplexer channels 3 intput to the volunteer configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHANNEL4_MUX</name>
              <description>DMA request multiplexer channels 4 intput to the volunteer configuration</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>				
          </fields>
        </register>

        <register>
          <name>DMAMUX5_8_CFGR</name>
          <displayName>DMAMUX4_7_CFGR</displayName>
          <description>DMA request multiplexer channels 5 to 8 configuration registers</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>CHANNEL5_MUX</name>
              <description>DMA request multiplexer channels 5 intput to the volunteer configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHANNEL6_MUX</name>
              <description>DMA request multiplexer channels 6 intput to the volunteer configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>			
            <field>
              <name>CHANNEL7_MUX</name>
              <description>DMA request multiplexer channels 7 intput to the volunteer configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>			
            <field>
              <name>CHANNEL8_MUX</name>
              <description>DMA request multiplexer channels 8 intput to the volunteer configuration</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>				
          </fields>
        </register>

        <register>
          <name>DMAMUX9_12_CFGR</name>
          <displayName>DMAMUX9_12_CFGR</displayName>
          <description>DMA request multiplexer channels 9 to 12 configuration registers</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>CHANNEL9_MUX</name>
              <description>DMA request multiplexer channels 9 intput to the volunteer configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHANNEL10_MUX</name>
              <description>DMA request multiplexer channels 10 intput to the volunteer configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>			
            <field>
              <name>CHANNEL11_MUX</name>
              <description>DMA request multiplexer channels 11 intput to the volunteer configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>			
            <field>
              <name>CHANNEL12_MUX</name>
              <description>DMA request multiplexer channels 12 intput to the volunteer configuration</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>				
          </fields>
        </register>

        <register>
          <name>DMAMUX13_16_CFGR</name>
          <displayName>DMAMUX13_16_CFGR</displayName>
          <description>DMA request multiplexer channels 13 to 16 configuration registers</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>CHANNEL13_MUX</name>
              <description>DMA request multiplexer channels 13 intput to the volunteer configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHANNEL14_MUX</name>
              <description>DMA request multiplexer channels 14 intput to the volunteer configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>			
            <field>
              <name>CHANNEL15_MUX</name>
              <description>DMA request multiplexer channels 15 intput to the volunteer configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>			
            <field>
              <name>CHANNEL16_MUX</name>
              <description>DMA request multiplexer channels 16 intput to the volunteer configuration</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>				
          </fields>
        </register>
