Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx.svd
				<register>
					<name>R32_UEP0_MAX_LEN</name>
					<description>endpoint 0 max length packet register</description>
					<addressOffset>0X5C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UEP0_MAX_LEN</name>
							<description>endpoint 0 max acceptable offset length</description>
							<bitRange>[10:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UEP1_MAX_LEN</name>
					<description>endpoint 1 max length packet register</description>
					<addressOffset>0X60</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UEP1_MAX_LEN</name>
							<description>endpoint 1 max acceptable offset length</description>
							<bitRange>[6:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UEP2_MAX_LEN</name>
					<description>endpoint 2 max length packet register</description>
					<addressOffset>0X64</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UEP2_MAX_LEN</name>
							<description>endpoint 2 max acceptable offset length</description>
							<bitRange>[6:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UEP3_MAX_LEN</name>
					<description>endpoint 3 max length packet register</description>
					<addressOffset>0X68</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UEP3_MAX_LEN</name>
							<description>endpoint 3 max acceptable offset length</description>
							<bitRange>[6:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UEP4_MAX_LEN</name>
					<description>endpoint 4 max length packet register</description>
					<addressOffset>0X6C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UEP4_MAX_LEN</name>
							<description>endpoint 4 max acceptable offset length</description>
							<bitRange>[6:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UEP5_MAX_LEN</name>
					<description>endpoint 5 max length packet register</description>
					<addressOffset>0X70</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UEP5_MAX_LEN</name>
							<description>endpoint 5 max acceptable offset length</description>
							<bitRange>[6:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UEP6_MAX_LEN</name>
					<description>endpoint 6 max length packet register</description>
					<addressOffset>0X74</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UEP6_MAX_LEN</name>
							<description>endpoint 6 max acceptable offset length</description>
							<bitRange>[6:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UEP7_MAX_LEN</name>
					<description>endpoint 7 max length packet register</description>
					<addressOffset>0X78</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UEP7_MAX_LEN</name>
							<description>endpoint 7 max acceptable offset length</description>
							<bitRange>[6:0]</bitRange>
						</field>
					</fields>
				</register>

				<register>
					<name>R16_UEP0_RX_LEN</name>
					<description>endpoint 0 acceptable length</description>
					<addressOffset>0X7C</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEP0_RX_LEN</name>
							<description>endpoint 0 acceptable data length</description>
							<bitRange>[6:0]</bitRange>
						</field>
					</fields>
				</register>

				<register>
					<name>R16_UEP1_RX_LEN</name>
					<description>endpoint 1 receives the lenth register in a single pass</description>
					<addressOffset>0X80</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEP1_RX_LEN</name>
							<description>the length of data received by endpoint 1 in a single pass</description>
							<bitRange>[15:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R16_UEP2_RX_LEN</name>
					<description>endpoint 2 receives the lenth register in a single pass</description>
					<addressOffset>0X84</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEP2_RX_LEN</name>
							<description>the length of data received by endpoint 2 in a single pass</description>
							<bitRange>[15:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R16_UEP3_RX_LEN</name>
					<description>endpoint 3 receives the lenth register in a single pass</description>
					<addressOffset>0X88</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEP3_RX_LEN</name>
							<description>the length of data received by endpoint 3 in a single pass</description>
							<bitRange>[15:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R16_UEP4_RX_LEN</name>
					<description>endpoint 4 receives the lenth register in a single pass</description>
					<addressOffset>0X8c</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEP4_RX_LEN</name>
							<description>the length of data received by endpoint 4 in a single pass</description>
							<bitRange>[15:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R16_UEP5_RX_LEN</name>
					<description>endpoint 5 receives the lenth register in a single pass</description>
					<addressOffset>0X90</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEP5_RX_LEN</name>
							<description>the length of data received by endpoint 5 in a single pass</description>
							<bitRange>[15:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP6_RX_LEN</name>
					<description>endpoint 6 receives the lenth register in a single pass</description>
					<addressOffset>0X94</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEP6_RX_LEN</name>
							<description>the length of data received by endpoint 6 in a single pass</description>
							<bitRange>[15:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R16_UEP7_RX_LEN</name>
					<description>endpoint 7 receives the lenth register in a single pass</description>
					<addressOffset>0X98</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEP7_RX_LEN</name>
							<description>the length of data received by endpoint 7 in a single pass</description>
							<bitRange>[15:0]</bitRange>
						</field>
					</fields>
				</register>

				<register>
					<name>R16_UEP1_R_SIZE</name>
					<description>the length register of the total received data at endpoint 1</description>
					<addressOffset>0X82</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEP1_R_SIZE</name>
							<description>the length of the total received data at endpoint 1</description>
							<bitRange>[15:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R16_UEP2_R_SIZE</name>
					<description>the length register of the total received data at endpoint 2</description>
					<addressOffset>0X86</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEP2_R_SIZE</name>
							<description>the length of the total received data at endpoint 2</description>
							<bitRange>[15:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R16_UEP3_R_SIZE</name>
					<description>the length register of the total received data at endpoint 3</description>
					<addressOffset>0X8A</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEP3_R_SIZE</name>
							<description>the length of the total received data at endpoint 3</description>
							<bitRange>[15:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R16_UEP4_R_SIZE</name>
					<description>the length register of the total received data at endpoint 4</description>
					<addressOffset>0X8E</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEP4_R_SIZE</name>
							<description>the length of the total received data at endpoint 4</description>
							<bitRange>[15:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R16_UEP5_R_SIZE</name>
					<description>the length register of the total received data at endpoint 5</description>
					<addressOffset>0X92</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEP5_R_SIZE</name>
							<description>the length of the total received data at endpoint 5</description>
							<bitRange>[15:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R16_UEP6_R_SIZE</name>
					<description>the length register of the total received data at endpoint 6</description>
					<addressOffset>0X96</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEP6_R_SIZE</name>
							<description>the length of the total received data at endpoint 6</description>
							<bitRange>[15:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R16_UEP7_R_SIZE</name>
					<description>the length register of the total received data at endpoint 7</description>
					<addressOffset>0X9A</addressOffset>
					<size>0x10</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEP7_R_SIZE</name>
							<description>the length of the total received data at endpoint 7</description>
							<bitRange>[15:0]</bitRange>
						</field>
					</fields>
				</register>

				<register>
					<name>R16_UEP0_T_LEN</name>
					<description>endpoint 0 send the length</description>
					<addressOffset>0x9C</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEP0_T_LEN</name>
							<description>endpoint 0 send the length</description>
							<bitRange>[6:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UEP0_TX_CTRL</name>
					<description>endpoint 0 send control register</description>
					<addressOffset>0x9E</addressOffset>
					<size>0x08</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RB_UEP_T_RES_MASK</name>
							<description> endpoint 0 control of the send response to IN transactions</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_TOG_MASK</name>
							<description> endpoint 0 synchronous trigger bit for the sender to
								prepare</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_NAK_ACT</name>
							<description>endpoint 0 sends the end flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_DONE</name>
							<description>endpoint 0 sends the end of NAK flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>

				<register>
					<name>R8_UEP0_RX_CTRL</name>
					<description>endpoint 0 send control register</description>
					<addressOffset>0x9F</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UEP_R_RES_MASK</name>
							<description>endpoint 0 has control over the received response</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_TOG_MASK</name>
							<description>the reception of endpoint 0 expects a synchronous trigger
								bit</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_SETUP_IS</name>
							<description>whether endpoint 0 receives a SETUP transaction</description>
							<bitRange>[3:3]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UEP_R_TOG_MATCH</name>
							<description>received synchronization trigger bit matches the desired
								synchronization trigger bit state</description>
							<bitRange>[4:4]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UEP_R_NAK_TOG</name>
							<description>endpoint 0 for the received return NAK,packet type</description>
							<bitRange>[5:5]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UEP_R_NAK_ACT</name>
							<description>endpoint 0 receives the end of NAK flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_DONE</name>
							<description>endpoint 0 receives the end flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>

				<register>
					<name>R16_UEP1_T_LEN</name>
					<description>endpoint 1 send the length register</description>
					<addressOffset>0xA0</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEP1_T_LEN</name>
							<description> endpoint 1 send the length</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UEP1_TX_CTRL</name>
					<description>endpoint 1 send control register</description>
					<addressOffset>0xA2</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UEP_T_RES_MASK</name>
							<description> endpoint 1 control of the send response to IN transactions</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_TOG_MASK</name>
							<description> endpoint 1 synchronous trigger bit for the sender to
								prepare</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_NAK_ACT</name>
							<description>endpoint 1 sends the end flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_DONE</name>
							<description>endpoint 1 sends the end of NAK flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UEP1_RX_CTRL</name>
					<description>endpoint 1 receive control</description>
					<addressOffset>0xA3</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UEP_R_RES_MASK</name>
							<description>endpoint 1 has control over the received response</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_TOG_MASK</name>
							<description>the reception of endpoint 1 expects a synchronous trigger
								bit</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_TOG_MATCH</name>
							<description>received synchronization trigger bit matches the desired
								synchronization trigger bit state</description>
							<bitRange>[4:4]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UEP_R_NAK_TOG</name>
							<description>endpoint 1 for the received return NAK,packet type</description>
							<bitRange>[5:5]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UEP_R_NAK_ACT</name>
							<description>endpoint 1 receives the end of NAK flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_DONE</name>
							<description>endpoint 1 receives the end flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>

				<register>
					<name>R16_UEP2_T_LEN</name>
					<description>endpoint 2 send the length register</description>
					<addressOffset>0xA4</addressOffset>
					<size>0x10</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>UEP2_T_LEN</name>
							<description> endpoint 2 send the length</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP2_TX_CTRL</name>
					<description>endpoint 2 send control register</description>
					<addressOffset>0xA6</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UEP_T_RES_MASK</name>
							<description> endpoint 2 control of the send response to IN transactions</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_TOG_MAS</name>
							<description> endpoint 2 synchronous trigger bit for the sender to
								prepare</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_NAK_ACT</name>
							<description>endpoint 2 sends the end flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_DONE</name>
							<description>endpoint 2 sends the end of NAK flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UEP2_RX_CTRL</name>
					<description>endpoint 2 receive control</description>
					<addressOffset>0xA7</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UEP_R_RES_MASK</name>
							<description>endpoint 2 has control over the received response</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_TOG_MASK</name>
							<description>the reception of endpoint 2 expects a synchronous trigger
								bit</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_TOG_MATCH</name>
							<description>received synchronization trigger bit matches the desired
								synchronization trigger bit state</description>
							<bitRange>[4:4]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UEP_R_NAK_TOG</name>
							<description>endpoint 2 for the received return NAK,packet type</description>
							<bitRange>[5:5]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UEP_R_NAK_ACT</name>
							<description>endpoint 2 receives the end of NAK flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_DONE</name>
							<description>endpoint 2 receives the end flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>

				<register>
					<name>R16_UEP3_T_LEN</name>
					<description>endpoint 3 send the length register</description>
					<addressOffset>0xA8</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEP3_T_LEN</name>
							<description> endpoint 3 send the length</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UEP3_TX_CTRL</name>
					<description>endpoint 3 send control register</description>
					<addressOffset>0xAA</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UEP_T_RES_MASK</name>
							<description> endpoint 3 control of the send response to IN transactions</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_TOG_MASK</name>
							<description> endpoint 3 synchronous trigger bit for the sender to
								prepare</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_NAK_ACT</name>
							<description>endpoint 3 sends the end flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_DONE</name>
							<description>endpoint 3 sends the end of NAK flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
