Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx.svd
				<register>
					<name>UEP3_RX_CTRL</name>
					<description>endpoint 3 receive control</description>
					<addressOffset>0xAB</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UEP_R_RES_MASK</name>
							<description>endpoint 3 has control over the received response</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_TOG_MASK</name>
							<description>the reception of endpoint 3 expects a synchronous trigger
								bit</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_TOG_MATCH</name>
							<description>received synchronization trigger bit matches the desired
								synchronization trigger bit state</description>
							<bitRange>[4:4]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UEP_R_NAK_TOG</name>
							<description>endpoint 3 for the received return NAK,packet type</description>
							<bitRange>[5:5]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UEP_R_NAK_ACT</name>
							<description>endpoint 3 receives the end of NAK flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_DONE</name>
							<description>endpoint 3 receives the end flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>

				<register>
					<name>R16_UEP4_T_LEN</name>
					<description>endpoint 4 send the length register</description>
					<addressOffset>0xAC</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEP4_T_LEN</name>
							<description> endpoint 4 send the length</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP4_TX_CTRL</name>
					<description>endpoint 4 send control register</description>
					<addressOffset>0xAE</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UEP_T_RES_MASK</name>
							<description> endpoint 4 control of the send response to IN transactions</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_TOG_MASK</name>
							<description> endpoint 4 synchronous trigger bit for the sender to
								prepare</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_NAK_ACT</name>
							<description>endpoint 4 sends the end flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_DONE</name>
							<description>endpoint 4 sends the end of NAK flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UEP4_RX_CTRL</name>
					<description>endpoint 4 receive control</description>
					<addressOffset>0xAF</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UEP_R_RES_MASK</name>
							<description>endpoint 4 has control over the received response</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_TOG_MASK</name>
							<description>the reception of endpoint 4 expects a synchronous trigger
								bit</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_TOG_MATCH</name>
							<description>received synchronization trigger bit matches the desired
								synchronization trigger bit state</description>
							<bitRange>[4:4]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UEP_R_NAK_TOG</name>
							<description>endpoint 4 for the received return NAK,packet type</description>
							<bitRange>[5:5]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UEP_R_NAK_ACT</name>
							<description>endpoint 4 receives the end of NAK flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_DONE</name>
							<description>endpoint 4 receives the end flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>

				<register>
					<name>R16_UEP5_T_LEN</name>
					<description>endpoint 5 send the length register</description>
					<addressOffset>0xB0</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEP5_T_LEN</name>
							<description> endpoint 5 send the length</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UEP5_TX_CTRL</name>
					<description>endpoint 5 send control register</description>
					<addressOffset>0xB2</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UEP_T_RES_MASK</name>
							<description> endpoint 5 control of the send response to IN transactions</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_TOG_MASK</name>
							<description> endpoint 5 synchronous trigger bit for the sender to
								prepare</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_NAK_ACT</name>
							<description>endpoint 5 sends the end flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_DONE</name>
							<description>endpoint 5 sends the end of NAK flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UEP5_RX_CTRL</name>
					<description>endpoint 5 receive control</description>
					<addressOffset>0xB3</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UEP_R_RES_MASK</name>
							<description>endpoint 5 has control over the received response</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_TOG_MASK</name>
							<description>the reception of endpoint 5 expects a synchronous trigger
								bit</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_TOG_MATCH</name>
							<description>received synchronization trigger bit matches the desired
								synchronization trigger bit state</description>
							<bitRange>[4:4]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UEP_R_NAK_TOG</name>
							<description>endpoint 5 for the received return NAK,packet type</description>
							<bitRange>[5:5]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UEP_R_NAK_ACT</name>
							<description>endpoint 5 receives the end of NAK flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_DONE</name>
							<description>endpoint 5 receives the end flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>

				<register>
					<name>R16_UEP6_T_LEN</name>
					<description>endpoint 6 send the length register</description>
					<addressOffset>0xB4</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEP6_T_LEN</name>
							<description> endpoint 6 send the length</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UEP6_TX_CTRL</name>
					<description>endpoint 6 send control register</description>
					<addressOffset>0xB6</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UEP_T_RES_MASK</name>
							<description> endpoint 6 control of the send response to IN transactions</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_TOG_MASK</name>
							<description> endpoint 6 synchronous trigger bit for the sender to
								prepare</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_NAK_ACT</name>
							<description>endpoint 6 sends the end flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_DONE</name>
							<description>endpoint 6 sends the end of NAK flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UEP6_RX_CTRL</name>
					<description>endpoint 6 receive control</description>
					<addressOffset>0xB7</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UEP_R_RES_MASK</name>
							<description>endpoint 6 has control over the received response</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_TOG_MASK</name>
							<description>the reception of endpoint 6 expects a synchronous trigger
								bit</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_TOG_MATCH</name>
							<description>received synchronization trigger bit matches the desired
								synchronization trigger bit state</description>
							<bitRange>[4:4]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UEP_R_NAK_TOG</name>
							<description>endpoint 6 for the received return NAK,packet type</description>
							<bitRange>[5:5]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UEP_R_NAK_ACT</name>
							<description>endpoint 6 receives the end of NAK flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_DONE</name>
							<description>endpoint 6 receives the end flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>

				<register>
					<name>R16_UEP7_T_LEN</name>
					<description>endpoint 7 send the length register</description>
					<addressOffset>0xB8</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEP7_T_LEN</name>
							<description> endpoint 7 send the length</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UEP7_TX_CTRL</name>
					<description>endpoint 7 send control register</description>
					<addressOffset>0xBA</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UEP_T_RES_MASK</name>
							<description> endpoint 7 control of the send response to IN transactions</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_TOG_MASK</name>
							<description> endpoint 7 synchronous trigger bit for the sender to
								prepare</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_NAK_ACT</name>
							<description>endpoint 7 sends the end flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_DONE</name>
							<description>endpoint 7 sends the end of NAK flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UEP7_RX_CTRL</name>
					<description>endpoint 7 receive control</description>
					<addressOffset>0xBB</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UEP_R_RES_MASK</name>
							<description>endpoint 7 has control over the received response</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_TOG_MASK</name>
							<description>the reception of endpoint 7 expects a synchronous trigger
								bit</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_TOG_MATCH</name>
							<description>received synchronization trigger bit matches the desired
								synchronization trigger bit state</description>
							<bitRange>[4:4]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UEP_R_NAK_TOG</name>
							<description>endpoint 7 for the received return NAK,packet type</description>
							<bitRange>[5:5]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UEP_R_NAK_ACT</name>
							<description>endpoint 7 receives the end of NAK flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_DONE</name>
							<description>endpoint 7 receives the end flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>

				<register>
					<name>R16_UEP_T_ISO</name>
					<description>usb endpoint sends a synchronous mode enable register</description>
					<addressOffset>0xBC</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RB_UEP_T_FIFO_EN</name>
							<description>The FIFO mode of the TX of the endpoint is enabled</description>
							<bitRange>[15:9]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>RB_UEPn_T_ISO_EN</name>
							<description>upload endpoint(IN) synchronization mode enabled</description>
							<bitRange>[7:1]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>

				<register>
					<name>R16_UEP_R_ISO</name>
					<description>usb endpoint receives a synchronous mode enable register</description>
					<addressOffset>0xBE</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RB_UEP_R_FIFO_EN</name>
							<description>The FIFO mode of the TX of the endpoint is enabled</description>
							<bitRange>[15:9]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEPn_R_ISO_EN</name>
							<description>down endpoint(OUT) synchronization mode enabled</description>
							<bitRange>[7:1]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				
				<register>
					<name>R32_UEP1_RX_FIFO</name>
					<description>Receive FIFO address of usb endpoint 1</description>
					<addressOffset>0xC0</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_UEP_RX_FIFO_E</name>
							<description>The end FIFO address of the receiving endpoint</description>
							<bitRange>[31:16]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>RB_UEP_RX_FIFO_S</name>
							<description>The FIFO start address of the receiving endpoint</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>				
				
				<register>
					<name>R32_UEP2_RX_FIFO</name>
					<description>Receive FIFO address of usb endpoint 2</description>
					<addressOffset>0xC4</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_UEP_RX_FIFO_E</name>
							<description>The end FIFO address of the receiving endpoint</description>
							<bitRange>[31:16]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>RB_UEP_RX_FIFO_S</name>
							<description>The FIFO start address of the receiving endpoint</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>					
				
				<register>
					<name>R32_UEP3_RX_FIFO</name>
					<description>Receive FIFO address of usb endpoint 3</description>
					<addressOffset>0xC8</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_UEP_RX_FIFO_E</name>
							<description>The end FIFO address of the receiving endpoint</description>
							<bitRange>[31:16]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>RB_UEP_RX_FIFO_S</name>
							<description>The FIFO start address of the receiving endpoint</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>					
				
				<register>
					<name>R32_UEP4_RX_FIFO</name>
					<description>Receive FIFO address of usb endpoint 4</description>
					<addressOffset>0xCC</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_UEP_RX_FIFO_E</name>
							<description>The end FIFO address of the receiving endpoint</description>
							<bitRange>[31:16]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>RB_UEP_RX_FIFO_S</name>
							<description>The FIFO start address of the receiving endpoint</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>	

				<register>
					<name>R32_UEP5_RX_FIFO</name>
					<description>Receive FIFO address of usb endpoint 5</description>
					<addressOffset>0xD0</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_UEP_RX_FIFO_E</name>
							<description>The end FIFO address of the receiving endpoint</description>
							<bitRange>[31:16]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>RB_UEP_RX_FIFO_S</name>
							<description>The FIFO start address of the receiving endpoint</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>	

				<register>
					<name>R32_UEP6_RX_FIFO</name>
					<description>Receive FIFO address of usb endpoint 6</description>
					<addressOffset>0xD4</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_UEP_RX_FIFO_E</name>
							<description>The end FIFO address of the receiving endpoint</description>
							<bitRange>[31:16]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>RB_UEP_RX_FIFO_S</name>
							<description>The FIFO start address of the receiving endpoint</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>	

				<register>
					<name>R32_UEP7_RX_FIFO</name>
					<description>Receive FIFO address of usb endpoint 7</description>
					<addressOffset>0xD8</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_UEP_RX_FIFO_E</name>
							<description>The end FIFO address of the receiving endpoint</description>
							<bitRange>[31:16]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>RB_UEP_RX_FIFO_S</name>
							<description>The FIFO start address of the receiving endpoint</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>	

				<register>
					<name>R32_UEP1_TX_FIFO</name>
					<description>The sending FIFO address of usb endpoint 1</description>
					<addressOffset>0xDC</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_UEP_TX_FIFO_E</name>
							<description>The end FIFO address of the sending endpoint</description>
							<bitRange>[31:16]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>RB_UEP_TX_FIFO_S</name>
							<description>The FIFO start address of the sending endpoint</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>	

				<register>
					<name>R32_UEP2_TX_FIFO</name>
					<description>The sending FIFO address of usb endpoint 2</description>
					<addressOffset>0xE0</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_UEP_TX_FIFO_E</name>
							<description>The end FIFO address of the sending endpoint</description>
							<bitRange>[31:16]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>RB_UEP_TX_FIFO_S</name>
							<description>The FIFO start address of the sending endpoint</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>	

				<register>
					<name>R32_UEP3_TX_FIFO</name>
					<description>The sending FIFO address of usb endpoint 3</description>
					<addressOffset>0xE4</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_UEP_TX_FIFO_E</name>
							<description>The end FIFO address of the sending endpoint</description>
							<bitRange>[31:16]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>RB_UEP_TX_FIFO_S</name>
							<description>The FIFO start address of the sending endpoint</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>	

				<register>
					<name>R32_UEP4_TX_FIFO</name>
					<description>The sending FIFO address of usb endpoint 4</description>
					<addressOffset>0xE8</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_UEP_TX_FIFO_E</name>
							<description>The end FIFO address of the sending endpoint</description>
							<bitRange>[31:16]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>RB_UEP_TX_FIFO_S</name>
							<description>The FIFO start address of the sending endpoint</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>	

