Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx.svd
				<register>
					<name>UEP7_RX_CFG</name>
					<description>Endpoint 7 Configuration Register</description>
					<addressOffset>0x190</addressOffset>
					<size>0x8</size>
					<resetValue>0x86</resetValue>
					<fields>
						<field>
							<name>RB_EP_RX_CHAIN_AUTO</name>
							<description>CHAIN automatically switches modes, and this mode is recommended</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>RB_EP_RX_FIFO_MODE</name>
							<description>If the bit is 1, the current endpoint uses FIFO mode,
							and the start and end addresses of the FIFO should be configured before the bit is 1.</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_FIFO_CFG</name>
							<description>Access offset address 0xC~0xF, and the operation object</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_TOUT_MODE</name>
							<description>This bit is 1, and when a continuous burst packet is received, 
							PP=1 and not a short packet is not received, and DPH is not received after the timeout, resulting in TOUT_IF interrupt</description>
							<bitRange>[4:4]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_EOB_MODE</name>
							<description>This bit is 1, and when a short packet or DP(PP=0) is received, 
							clearing all CHAIN_EN will result in an NRDY response to the subsequent DPH; 
							Software reconfiguration required. </description>
							<bitRange>[3:3]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>RB_EP_RX_ERDY_AUTO</name>
							<description>ERDY automatic mode, the hardware will send ERDY,
							no software control required; It is recommended that the synchronization endpoint zero out this bit.</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_SEQ_AUTO</name>
							<description>1: It is forbidden to write R16_EPn_ST->EP_SEQ_NUM software;
										0: allows the software to write R16_EPn_ST->EP_SEQ_NUM.</description>
							<bitRange>[1:1]</bitRange>
							<access>read-write</access>
						</field>						
						<field>
							<name>RB_EP_RX_ISO_MODE</name>
							<description>A value of 1 indicates that the current endpoint is a synchronous endpoint</description>
							<bitRange>[0:0]</bitRange>
							<access>read-write</access>
						</field>						
					</fields>
				</register>
				<register>
					<name>UEP7_RX_CR</name>
					<description>Endpoint 7 control register</description>
					<addressOffset>0x191</addressOffset>
					<size>0x8</size>
					<resetValue>0x10</resetValue>
					<fields>
						<field>
							<name>RB_EP_RX_HALT</name>
							<description>Endpoint Stop, High Validity, Endpoint Stop Answering STALL to DPH.</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>RB_EP_RX_CLR</name>
							<description>Write 1 clears all configuration values and status of the endpoint, except for UEP_CFG.</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_CHAIN_CLR</name>
							<description>Write 1 clears all CHAIN configuration values and statuses</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_ERDY_NUMP</name>
							<description>The nump field of ERDY-TP is sent by the hardware, 
							and the value is generally set to the number of supported bursts. 
							For example, if you support 16 bursts, the value of this field is 16.</description>
							<bitRange>[4:0]</bitRange>
							<access>read-write</access>
						</field>						
					</fields>
				</register>
				<register>
					<name>UEP7_RX_SEQ</name>
					<description>Endpoint 7 Serial Number Register</description>
					<addressOffset>0x192</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_EP_RX_SEQ_NUM</name>
							<description>The current serial number of the endpoint,
							writable in non-SEQ_AUTO mode,
							read-only in SEQ_AUTO mode</description>
							<bitRange>[4:0]</bitRange>
							<access>read-write</access>
						</field>						
					</fields>
				</register>
				<register>
					<name>UEP7_RX_ST</name>
					<description>Endpoint 7 status register</description>
					<addressOffset>0x193</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_EP_RX_INT_FLAG</name>
							<description>The current break flag for the endpoint, the bit is read-only,
							and all CHAIN_IF are 0 if the bit is 0, otherwise it is 1.</description>
							<bitRange>[7:7]</bitRange>
							<access>read-only</access>
						</field>					
						<field>
							<name>RB_EP_RX_FC_ST</name>
							<description>The endpoint is in the current throttling state, and write 1 is cleared to zero.</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_ERDY_REQ</name>
							<description>Indicates that the ERDY is currently being sent;
							Writing 1 to that bit will send ERDY, which is used in non-ERDY_AUTO mode.</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_CHAIN_RES</name>
							<description>CHAIN response state, corresponding to 4 separate CHAINS</description>
							<bitRange>[4:4]</bitRange>
							<access>read-only</access>
						</field>	
						<field>
							<name>RB_ER_RX_CHAIN_EN</name>
							<description>The CHAIN enabled state, which corresponds to 4 independent CHAINS.</description>
							<bitRange>[3:0]</bitRange>
							<access>read-only</access>
						</field>						
					</fields>
				</register>
				<register>
					<name>UEP7_RX_CHAIN_CR</name>
					<description>Endpoint 7 CHAIN control register</description>
					<addressOffset>0x194</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_EP_RX_CUR_USE</name>
							<description>The CHAIN serial number currently in use</description>
							<bitRange>[7:6]</bitRange>
							<access>read-only</access>
						</field>					
						<field>
							<name>RB_EP_RX_CUR_CFG</name>
							<description>The chain serial number of the current configuration.</description>
							<bitRange>[5:4]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_EP_RX_FORCE_RET</name>
							<description>This bit effectively forces the return of the selected CHAIN state machine configuration</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_RET_SEL</name>
							<description>When the FORCE_RET is valid, this bit indicates the returned CHAIN status and configuration</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>						
					</fields>
				</register>
				<register>
					<name>UEP7_RX_CHAIN_ST</name>
					<description>Endpoint 7 CHAIN state register</description>
					<addressOffset>0x195</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_EP_RX_CHAIN_EN</name>
							<description>The currently used CHAIN enables the automatic hardware setting of 1 after the UEP_CHAIN_NUMP register is configured, 
							and the CHAIN is automatically cleared to zero after the transmission is completed</description>
							<bitRange>[7:7]</bitRange>
							<access>read-only</access>
						</field>					
						<field>
							<name>RB_EP_RX_CHAIN_IF</name>
							<description>This bit is only written, and 1 is written to release the current CHAIN_IF</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_LPF_FLAG</name>
							<description>Only the synchronous downhaul endpoint is used to currently receive the LPF status in the DPH.</description>
							<bitRange>[5:5]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_NUMP_EMPTY</name>
							<description>IF THE NUMP IN THE CHAIN IS 0, THE POSITION IS 1</description>
							<bitRange>[3:3]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_EP_RX_DPH_PP</name>
							<description>The status of the PP bits in the currently received DPH</description>
							<bitRange>[2:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_EP_RX_CHAIN_NO</name>
							<description>The serial number of the CHAIN that is currently interrupting</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>						
					</fields>
				</register>
				<register>
					<name>UEP7_RX_CHAIN_LEN</name>
					<description>Endpoint 7 CHAIN sends the last packet length</description>
					<addressOffset>0x196</addressOffset>
					<size>0x10</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_EP_RX_CHAIN_RX_LEN</name>
							<description>The length of the currently completed CHAIN to the last packet.</description>
							<bitRange>[10:0]</bitRange>
							<access>read-only</access>
						</field>											
					</fields>
				</register>
				<register>
					<name>UEP7_RX_CHAIN_MAX_NUMP</name>
					<description>Number of NUMPs that Endpoint 7 can receive</description>
					<addressOffset>0x198</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RX_CHAIN_MAX_NUMP</name>
							<description>The number of DPP packets that can be received  by the CHAIN</description>
							<bitRange>[7:0]</bitRange>
							<access>read-only</access>
						</field>											
					</fields>
				</register>
				<register>
					<name>UEP7_RX_CHAIN_NUMP</name>
					<description>Number of NUMPs has been received by Endpoint 7</description>
					<addressOffset>0x199</addressOffset>
					<size>0x8</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>TX_CHAIN_NUMP</name>
							<description>The number of DPP packets that has received</description>
							<bitRange>[7:0]</bitRange>
							<access>read-only</access>
						</field>										
					</fields>
				</register>
				<register>
					<name>UEP7_RX_DMA_OFS</name>
					<description>DMA offset length for Endpoint 7</description>
					<addressOffset>0x19A</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CHAIN_DMA_OFS</name>
							<description>The offset address of the DPP in that CHAIN</description>
							<bitRange>[15:0]</bitRange>
							<access>read-only</access>
						</field>											
					</fields>
				</register>
				<register>
					<name>UEP7_RX_DMA</name>
					<description>DMA start address for Endpoint 7</description>
					<addressOffset>0x19C</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CHAIN_RX_DMA</name>
							<description>Normal mode:The DMA start address of the CHAIN to receive  data.
							FIFO mode:16~23 bits of the FIFO start address in SRAM;The FIFO end address is 16~23 bits of the mapped address in SRAM.</description>
							<bitRange>[31:0]</bitRange>
							<access>read-write</access>
						</field>											
					</fields>
				</register>

				<register>
					<name>UH_TX_CTRL</name>
					<description>Host Transmit Control Registers</description>
					<addressOffset>0x84</addressOffset>
					<alternateRegister>UEP0_TX_CTRL</alternateRegister>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_UH_TX_ACT</name>
							<description>The IN transaction completes the interrupt flag, the software writes 0 to zero, and the hardware sets 1.</description>
							<bitRange>[31:31]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>RB_UH_TX_ISO</name>
							<description>The host prepares to send ISO packets. </description>
							<bitRange>[30:30]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UH_TX_SETUP</name>
							<description>Indicates that the packet sent by the host is a Setup packet, and the setup flag is set.</description>
							<bitRange>[29:29]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UH_TX_STATUS</name>
							<description>Indicates that the packet sent by the host is STATUS TP.</description>
							<bitRange>[28:28]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UH_TX_LPF</name>
							<description>For burst transmissions, this bit simply represents the LPF/EOB of the last packet, 
							and the LPF/EOB of the preceding packet uses a fixed value of 0.</description>
							<bitRange>[23:23]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>RB_UH_TX_RES</name>
							<description>Response to DPH+DPP</description>
							<bitRange>[22:21]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UH_TX_SEQ</name>
							<description>The SEQ _NUM for which the endpoint receives the packet, the hardware automatically adds 1, except for endpoint 0</description>
							<bitRange>[20:16]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UH_TX_EP</name>
							<description>Indicates the destination of the packet sent in host mode (the target endpoint number of the device)</description>
							<bitRange>[15:12]</bitRange>
							<access>read-write</access>
						</field>	
						<field>
							<name>RB_UH_TX_LEN</name>
							<description>The endpoint receives the length register, 
							which for burst transmissions indicates the packet length of the last packet of the burst transmission, 
							and the other packets must be 1024B as specified in the protocol.</description>
							<bitRange>[10:0]</bitRange>
							<access>read-write</access>
						</field>							
					</fields>
				</register>
				<register>
					<name>UH_RX_CTRL</name>
					<description>Host receives control registers</description>
					<addressOffset>0x88</addressOffset>
					<alternateRegister>UEP0_RX_CTRL</alternateRegister>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_UH_RX_ACT</name>
							<description>The OUT transaction completes the interrupt flag, the software writes 0 to zero, and the hardware sets 1</description>
							<bitRange>[31:31]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>RB_UH_RX_ISO</name>
							<description>Received Packets (DPP) are transmitted synchronously</description>
							<bitRange>[30:30]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UH_RX_NUMP</name>
							<description>The number of packets (DPP) that the endpoint is capable of receiving (burst transmission)</description>
							<bitRange>[28:24]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UH_RX_RES</name>
							<description>Response to DPH+DPP or STATUS-TP</description>
							<bitRange>[22:21]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UH_RX_SEQ</name>
							<description>The SEQ _NUM that the endpoint expects to receive, the hardware automatically adds 1, except for endpoint 0</description>
							<bitRange>[20:16]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>RB_UH_RX_EP</name>
							<description>Indicates the source (device endpoint number) from which the packet was received in host mode</description>
							<bitRange>[15:12]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UH_RX_LEN</name>
							<description>The endpoint receives the length register,
							which for burst transmissions indicates the packet length of the last packet of the burst transmission,
							and the other packets must be 1024B as specified in the protocol</description>
							<bitRange>[10:0]</bitRange>
							<access>read-only</access>
						</field>					
					</fields>
				</register>
				<register>
					<name>UH_TX_DMA_OFS</name>
					<description>Host Transmit Address Offset Register</description>
					<addressOffset>0x94</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000400</resetValue>
					<fields>
						<field>
							<name>RB_UH_TX_DMA_OFS</name>
							<description>After the host sends the DMA, the size of the DMA address offset</description>
							<bitRange>[31:0]</bitRange>
							<access>read-write</access>
						</field>											
					</fields>
				</register>
				<register>
					<name>UH_RX_DMA_OFS</name>
					<description>Host Receive Address Offset Register</description>
					<addressOffset>0x98</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000400</resetValue>
					<fields>
						<field>
							<name>RB_UH_RX_DMA_OFS</name>
							<description>After the host receives it, the DMA's address is offset by a large amount.</description>
							<bitRange>[31:0]</bitRange>
							<access>read-write</access>
						</field>											
					</fields>
				</register>	
				<register>
					<name>HOST_RX_NUMP</name>
					<description>The host receives the NUMP register</description>
					<addressOffset>0x9E</addressOffset>
					<size>0x10</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_UH_RX_DPP_NUM</name>
							<description>The number of DPPs that have been accepted by the host.</description>
							<bitRange>[15:8]</bitRange>
							<access>read-write</access>
						</field>					
						<field>
							<name>RB_UH_RX_NUMP</name>
							<description>The number of packets that the host expects to receive, 
							if it is a synchronous transmission, will automatically subtract 1 from the hardware for each packet it receives.</description>
							<bitRange>[7:0]</bitRange>
							<access>read-write</access>
						</field>						
					</fields>
				</register>
				<register>
					<name>HOST_STATUS</name>
					<description>Host Status Registers</description>
					<addressOffset>0xA0</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000100</resetValue>
					<fields>
						<field>
							<name>RB_UH_ITP_PRESAGE</name>
							<description>In host mode, this bit indicates the time when the ITP packet was sent</description>
							<bitRange>[19:18]</bitRange>
							<access>read-only</access>
						</field>					
						<field>
							<name>RB_UH_RX_ISO_PKT_ERR</name>
							<description>A CRC error was received for the packet (DPP) during synchronous transmission</description>
							<bitRange>[17:17]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UH_RX_EOB_LPF</name>
							<description>This bit represents the EOB/LPF status in the received packet</description>
							<bitRange>[16:16]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UH_RX_ERDY_DIR</name>
							<description>ERDY is received from the device, and the segment represents the direction of the endpoint</description>
							<bitRange>[15:15]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UH_RX_ERDY_NUMP</name>
							<description>ERDY received from the device, 
							which indicates the number of packets that can be sent/received by the device's corresponding endpoint</description>
							<bitRange>[12:8]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UH_RX_ERDY_EP</name>
							<description>ERDY is received from the device, and the segment represents the endpoint number of the device ERDY</description>
							<bitRange>[7:4]</bitRange>
							<access>read-only</access>
						</field>			
					</fields>
				</register>
				<register>
					<name>HOST_TX_FC_STATUS</name>
					<description>The host endpoint sends flow control register</description>
					<addressOffset>0xA4</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>EPx_TX_FC</name>
							<description>The flow control status of the host to send endpoints 1-15.</description>
							<bitRange>[15:1]</bitRange>
							<access>read-write</access>
						</field>											
					</fields>
				</register>
				<register>
					<name>HOST_RX_FC_STATUS</name>
					<description>The host endpoint receives the flow control register</description>
					<addressOffset>0xA6</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>EPx_RX_FC</name>
							<description>The flow control status of the host to receiving endpoints 1-15</description>
							<bitRange>[15:1]</bitRange>
							<access>read-write</access>
						</field>											
					</fields>
				</register>
				<register>
					<name>TP_RX_DATA0</name>
					<description>DEV_NOTIF-TP Data 0 Register</description>
					<addressOffset>0xA8</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>USB3_NOTIF_DATA0</name>
							<description>After the DEV_NOTIF-TP is received, the HP data is stored in this register</description>
							<bitRange>[31:0]</bitRange>
							<access>read-only</access>
						</field>											
					</fields>
				</register>
				<register>
					<name>TP_RX_DATA1</name>
					<description>DEV_NOTIF-TP Data 1 Register</description>
					<addressOffset>0xAC</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>USB3_NOTIF_DATA1</name>
							<description>After the DEV_NOTIF-TP is received, the HP data is stored in this register</description>
							<bitRange>[31:0]</bitRange>
							<access>read-only</access>
						</field>											
					</fields>
				</register>
				<register>
					<name>TP_RX_DATA2</name>
					<description>DEV_NOTIF-TP Data 2 Register</description>
					<addressOffset>0xB0</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>USB3_NOTIF_DATA2</name>
							<description>After the DEV_NOTIF-TP is received, the HP data is stored in this register</description>
							<bitRange>[31:0]</bitRange>
							<access>read-only</access>
						</field>											
					</fields>
				</register>

