Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx.svd
        <register>
          <name>DFSDM_FLT1ICR</name>
          <displayName>DFSDM_FLT1ICR</displayName>
          <description>interrupt flag clear register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLRSCDF</name>
              <description>Clear the short-circuit detector
              flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CLRCKABF</name>
              <description>Clear the clock absence
              flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CLRROVRF</name>
              <description>Clear the regular conversion overrun
              flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLRJOVRF</name>
              <description>Clear the injected conversion overrun
              flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_FLT1JCHGR</name>
          <displayName>DFSDM_FLT1JCHGR</displayName>
          <description>injected channel group selection
          register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>JCHG</name>
              <description>Injected channel group
              selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_FLT1FCR3</name>
          <displayName>FLT1FCR3</displayName>
          <description>control register 3</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FORD</name>
              <description>Sinc Filter Order</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>		
            <field>
              <name>FOSR</name>
              <description>Sinc filter oversampling rate</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IOSR</name>
              <description>The integrator oversampling rate is 2 to the power of IOSR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>					
          </fields>
        </register>
        <register>
          <name>DFSDM_FLT1JDATAR</name>
          <displayName>DFSDM_FLT1JDATAR</displayName>
          <description>data register for injected
          group</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>JDATA</name>
              <description>Injected group conversion
              data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
            <field>
              <name>JDATACH</name>
              <description>Injected channel most recently
              converted</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_FLT1RDATAR</name>
          <displayName>DFSDM_FLT1RDATAR</displayName>
          <description>data register for the regular
          channel</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDATA</name>
              <description>Regular channel conversion
              data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
            <field>
              <name>RPEND</name>
              <description>Regular channel pending
              data</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDATACH</name>
              <description>Regular channel most recently
              converted</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_FLT1AWHTR</name>
          <displayName>DFSDM_FLT1AWHTR</displayName>
          <description>analog watchdog high threshold
          register</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AWHT</name>
              <description>Analog watchdog high
              threshold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
            <field>
              <name>BKAWH</name>
              <description>Break signal assignment to analog
              watchdog high threshold event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_FLT1AWLTR</name>
          <displayName>DFSDM_FLT1AWLTR</displayName>
          <description>analog watchdog low threshold
          register</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AWLT</name>
              <description>Analog watchdog low
              threshold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
            <field>
              <name>BKAWL</name>
              <description>Break signal assignment to analog
              watchdog low threshold event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_FLT1AWSR</name>
          <displayName>DFSDM_FLT1AWSR</displayName>
          <description>analog watchdog status
          register</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AWHTF</name>
              <description>Analog watchdog high threshold
              flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>AWLTF</name>
              <description>Analog watchdog low threshold
              flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_FLT1AWCFR</name>
          <displayName>DFSDM_FLT1AWCFR</displayName>
          <description>analog watchdog clear flag
          register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLRAWHTF</name>
              <description>Clear the analog watchdog high threshold
              flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CLRAWLTF</name>
              <description>Clear the analog watchdog low threshold
              flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_FLT1EXMAX</name>
          <displayName>DFSDM_FLT1EXMAX</displayName>
          <description>Extremes detector maximum
          register</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXMAX</name>
              <description>Extremes detector maximum
              value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
            <field>
              <name>EXMAXCH</name>
              <description>Extremes detector maximum data
              channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_FLT1EXMIN</name>
          <displayName>DFSDM_FLT1EXMIN</displayName>
          <description>Extremes detector minimum
          register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXMIN</name>
              <description>EXMIN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
            <field>
              <name>EXMINCH</name>
              <description>Extremes detector minimum data
              channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_FLT1CNVTIMR</name>
          <displayName>DFSDM_FLT1CNVTIMR</displayName>
          <description>conversion timer register</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNVCNT</name>
              <description>28-bit timer counting conversion time t
              = CNVCNT[27:0] / fDFSDM_CKIN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>28</bitWidth>
            </field>
          </fields>
        </register>
