Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx.svd
		<register>
          <name>IPRIOR45</name>
          <displayName>IPRIOR45</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4B4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR46</name>
          <displayName>IPRIOR46</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4B8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR47</name>
          <displayName>IPRIOR47</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4BC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR48</name>
          <displayName>IPRIOR48</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4C0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR49</name>
          <displayName>IPRIOR49</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4C4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
	
		<register>
          <name>IPRIOR50</name>
          <displayName>IPRIOR50</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4C8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR51</name>
          <displayName>IPRIOR51</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4CC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR52</name>
          <displayName>IPRIOR52</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4D0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR53</name>
          <displayName>IPRIOR53</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4D4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR54</name>
          <displayName>IPRIOR54</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4D8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR55</name>
          <displayName>IPRIOR55</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR56</name>
          <displayName>IPRIOR56</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR57</name>
          <displayName>IPRIOR57</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR58</name>
          <displayName>IPRIOR58</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4E8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR59</name>
          <displayName>IPRIOR59</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4EC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>

		<register>
          <name>IPRIOR60</name>
          <displayName>IPRIOR60</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4F0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR61</name>
          <displayName>IPRIOR61</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4F4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR62</name>
          <displayName>IPRIOR62</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4F8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR63</name>
          <displayName>IPRIOR63</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4FC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>

		<register>
          <name>IALLOCR0</name>
          <displayName>IALLOCR0</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x600</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR1</name>
          <displayName>IALLOCR1</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x604</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR2</name>
          <displayName>IALLOCR2</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x608</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR3</name>
          <displayName>IALLOCR3</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x60C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR4</name>
          <displayName>IALLOCR4</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x610</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR5</name>
          <displayName>IALLOCR5</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x614</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR6</name>
          <displayName>IALLOCR6</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x618</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR7</name>
          <displayName>IALLOCR7</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x61C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR8</name>
          <displayName>IALLOCR8</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x620</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR9</name>
          <displayName>IALLOCR9</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x624</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR10</name>
          <displayName>IALLOCR10</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x628</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>

		<register>
          <name>IALLOCR11</name>
          <displayName>IALLOCR11</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x62C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR12</name>
          <displayName>IALLOCR12</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x630</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR13</name>
          <displayName>IALLOCR13</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x634</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR14</name>
          <displayName>IALLOCR14</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x638</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR15</name>
          <displayName>IALLOCR15</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x63C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR16</name>
          <displayName>IALLOCR6</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x640</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR17</name>
          <displayName>IALLOCR7</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x644</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR18</name>
          <displayName>IALLOCR8</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x648</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR19</name>
          <displayName>IALLOCR9</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x64C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR20</name>
          <displayName>IALLOCR20</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x650</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
		<register>
          <name>IALLOCR21</name>
          <displayName>IALLOCR21</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x654</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR22</name>
          <displayName>IALLOCR22</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x658</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR23</name>
          <displayName>IALLOCR23</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x65C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR24</name>
          <displayName>IALLOCR24</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x660</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR25</name>
          <displayName>IALLOCR25</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x664</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR26</name>
          <displayName>IALLOCR26</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x668</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR27</name>
          <displayName>IALLOCR27</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x66C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR28</name>
          <displayName>IALLOCR28</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x670</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR29</name>
          <displayName>IALLOCR29</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x674</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
		<register>
          <name>IALLOCR30</name>
          <displayName>IALLOCR30</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x678</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR31</name>
          <displayName>IALLOCR31</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x67C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR32</name>
          <displayName>IALLOCR32</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x680</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR33</name>
          <displayName>IALLOCR33</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x684</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR34</name>
          <displayName>IALLOCR34</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x688</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR35</name>
          <displayName>IALLOCR35</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x68C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR36</name>
          <displayName>IALLOCR36</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x690</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR37</name>
          <displayName>IALLOCR37</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x694</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR38</name>
          <displayName>IALLOCR38</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x698</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR39</name>
          <displayName>IALLOCR39</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x69C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
		<register>
          <name>IALLOCR40</name>
          <displayName>IALLOCR40</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x6A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR41</name>
          <displayName>IALLOCR41</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x6A4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR42</name>
          <displayName>IALLOCR42</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x6A8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR43</name>
          <displayName>IALLOCR43</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x6AC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR44</name>
          <displayName>IALLOCR44</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x6B0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR45</name>
          <displayName>IALLOCR45</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x6B4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR46</name>
          <displayName>IALLOCR46</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x6B8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR47</name>
          <displayName>IALLOCR47</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x6BC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR48</name>
          <displayName>IALLOCR48</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x6C0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR49</name>
          <displayName>IALLOCR49</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x6C4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
	
		<register>
          <name>IALLOCR50</name>
          <displayName>IALLOCR50</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x6C8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR51</name>
          <displayName>IALLOCR51</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x6CC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
