Community-PIO-CH32V/platform-ch32v/misc/svd/CH32H417xx.svd
		<register>
          <name>IALLOCR52</name>
          <displayName>IALLOCR52</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x6D0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR53</name>
          <displayName>IALLOCR53</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x6D4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR54</name>
          <displayName>IALLOCR54</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x6D8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR55</name>
          <displayName>IALLOCR55</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x6DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR56</name>
          <displayName>IALLOCR56</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x6E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR57</name>
          <displayName>IALLOCR57</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x6E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR58</name>
          <displayName>IALLOCR58</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x6E8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR59</name>
          <displayName>IALLOCR59</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x6EC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>

		<register>
          <name>IALLOCR60</name>
          <displayName>IALLOCR60</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x6F0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR61</name>
          <displayName>IALLOCR61</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x6F4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR62</name>
          <displayName>IALLOCR62</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x6F8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IALLOCR63</name>
          <displayName>IALLOCR63</displayName>
          <description>Interrupt Allocation Register</description>
          <addressOffset>0x6FC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>IAUTR1</name>
          <displayName>IAUTR1</displayName>
          <description>interrupts authority register 1</description>
          <addressOffset>0x700</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>		
            <field>
              <name>IAUT</name>
              <description>interrupt allocates all registers 
			  and is used to query whether the interrupt responds to each kernel allocation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>		
          </fields>
        </register>
        <register>
          <name>IAUTR2</name>
          <displayName>IAUTR2</displayName>
          <description>interrupts authority register 2</description>
          <addressOffset>0x704</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>		
            <field>
              <name>IAUT</name>
              <description>interrupt allocates all registers 
			  and is used to query whether the interrupt responds to each kernel allocation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>		
          </fields>
        </register>
        <register>
          <name>IAUTR3</name>
          <displayName>IAUTR3</displayName>
          <description>interrupts authority register 3</description>
          <addressOffset>0x708</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>		
            <field>
              <name>IAUT</name>
              <description>interrupt allocates all registers 
			  and is used to query whether the interrupt responds to each kernel allocation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>		
          </fields>
        </register>
        <register>
          <name>IAUTR4</name>
          <displayName>IAUTR4</displayName>
          <description>interrupts authority register 4</description>
          <addressOffset>0x70C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>		
            <field>
              <name>IAUT</name>
              <description>interrupt allocates all registers 
			  and is used to query whether the interrupt responds to each kernel allocation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>		
          </fields>
        </register>
        <register>
          <name>IAUTR5</name>
          <displayName>IAUTR5</displayName>
          <description>interrupts authority register 5</description>
          <addressOffset>0x710</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>		
            <field>
              <name>IAUT</name>
              <description>interrupt allocates all registers 
			  and is used to query whether the interrupt responds to each kernel allocation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>		
          </fields>
        </register>
        <register>
          <name>WAKEIP0</name>
          <displayName>WAKEIP0</displayName>
          <description>PFIC wake-up instruction pointer register 0</description>
          <addressOffset>0x720</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IP_RELOAD0</name>
              <description>The PC address register on kernel C0 wake-up, 
			  which is used to reload the PC value after power-on wake-up and reset wake-up</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>		
            <field>
              <name>SHUTDOWN0</name>
              <description>Kernel C0 Deep Sleep (Locked) Cancellation Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>		
          </fields>
        </register>
        <register>
          <name>WAKEIP1</name>
          <displayName>WAKEIP1</displayName>
          <description>PFIC wake-up instruction pointer register 1</description>
          <addressOffset>0x724</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IP_RELOAD1</name>
              <description>The PC address register on kernel C1 wake-up, 
			  which is used to reload the PC value after power-on wake-up and reset wake-up</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>		
            <field>
              <name>SHUTDOWN1</name>
              <description>Kernel C1 Deep Sleep (Locked) Cancellation Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>		
          </fields>
        </register>
        <register>
          <name>CSTAR0</name>
          <displayName>CSTAR0</displayName>
          <description>PFIC kernel status register 0</description>
          <addressOffset>0x780</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_nest_sta_0</name>
              <description>The nested status register of kernel C0 interrupts is used to
			  query the nested state of kernel C0 interrupts. nest_sta bits from the INEST_CTLR register of the CSR register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>		
            <field>
              <name>CPU_irq_active_0</name>
              <description>Kernel C0 interrupt active flag register, 
			  which is used to query whether kernel C0 is processing interrupts</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_irq_pend_0</name>
              <description>Kernel C0 interrupt pending flag register, which is used to query kernel C1 for unhandled interrupts</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>		
            <field>
              <name>CPU_globl_ie_0</name>
              <description>The kernel C0 global interrupt enable register is used to 
			  query whether the kernel C0 global interrupt is enabled</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_dbg_mode_0</name>
              <description>Kernel C0 debug mode register, which is used to query whether kernel C0 is in debug mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>		
            <field>
              <name>CPU_lock_up_0</name>
              <description>The kernel C0 lock status register is used to query whether kernel C0 is in the locked state</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_ex_state_0</name>
              <description>The kernel C0 status register is used to obtain the running state of kernel C0</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>					
          </fields>
        </register>
        <register>
          <name>CSTAR1</name>
          <displayName>CSTAR1</displayName>
          <description>PFIC kernel status register 1</description>
          <addressOffset>0x784</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_nest_sta_1</name>
              <description>The nested status register of kernel C1 interrupts is used to
			  query the nested state of kernel C1 interrupts. nest_sta bits from the INEST_CTLR register of the CSR register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>		
            <field>
              <name>CPU_irq_active_1</name>
              <description>Kernel C1 interrupt active flag register, 
			  which is used to query whether kernel C1 is processing interrupts</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_irq_pend_1</name>
              <description>Kernel C1 interrupt pending flag register, which is used to query kernel C1 for unhandled interrupts</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>		
            <field>
              <name>CPU_globl_ie_1</name>
              <description>The kernel C1 global interrupt enable register is used to 
			  query whether the kernel C1 global interrupt is enabled</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_dbg_mode_1</name>
              <description>Kernel C1 debug mode register, which is used to query whether kernel C1 is in debug mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>		
            <field>
              <name>CPU_lock_up_1</name>
              <description>The kernel C1 lock status register is used to query whether kernel C1 is in the locked state</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_ex_state_1</name>
              <description>The kernel C1 status register is used to obtain the running state of kernel C1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>					
          </fields>
        </register>		
        <register>
          <name>EENR</name>
          <displayName>EENR</displayName>
          <description>PFIC Event Enable Register</description>
          <addressOffset>0xC80</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>EVENTEN</name>
              <description>31-0 Event wake-up enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>				
          </fields>
        </register>
        <register>
          <name>EPR</name>
          <displayName>EPR</displayName>
          <description>PFIC Event Suspend Register</description>
          <addressOffset>0xC84</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT_PEND31_8</name>
              <description>31-8 event is suspended, write 1 to clear zero</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>		
            <field>
              <name>EVENT_PEND7_0</name>
              <description>7-0 Event Pending Status, Not Clearable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>		
          </fields>
        </register>
        <register>
          <name>EWUPR</name>
          <displayName>EWUPR</displayName>
          <description>PFIC Event Wake Register</description>
          <addressOffset>0xC88</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENT_WUP</name>
              <description>31-0 Event Wake Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>				
          </fields>
        </register>
		<register>
          <name>SCTLR</name>
          <displayName>SCTLR</displayName>
          <description>System Control Register</description>
          <addressOffset>0xD10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SLEEPONEXIT</name>
              <description>system leaves the state after an interruption</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			 <field>
              <name>SLEEPDEEP</name>
              <description>low power mode selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			 <field>
              <name>WFITOWFE</name>
              <description>ues WFI as WFE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
		  <field>
              <name>SEVONPEND</name>
              <description>SEVONPEND</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>SETEVENT</name>
              <description>set event</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>HART_ID</name>
              <description>Kernel ID register,
			  which is used to obtain the kernel ID of the reader register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
			<field>
              <name>SYSRST</name>
              <description>System reset</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
		</registers>
	</peripheral>

	</peripherals>
 </device>
